opinion/emacs-features.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My favorite GNU/Emacs features</title>
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="../img/favicon.png">
<link rel="stylesheet" type="text/css" href="../css/main.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">My favorite GNU/Emacs features</h1>
<p>
<a href="../index.html">Index</a> | <a href="index.html">Up</a>
</p>

<hr />

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#introduction">1. Introduction</a>
<ul>
<li><a href="#quick-note-about-vanilla-keybinds">1.1. Quick note about vanilla keybinds</a></li>
<li><a href="#quick-note-about-keybind-notation">1.2. Quick note about keybind notation</a></li>
</ul>
</li>
<li><a href="#general-design-choices">2. General design choices</a>
<ul>
<li><a href="#gui-vs-terminal">2.1. GUI vs. Terminal</a></li>
<li><a href="#emacs-lisp">2.2. Emacs Lisp</a></li>
</ul>
</li>
<li><a href="#built-in-features">3. Built-in features</a>
<ul>
<li><a href="#org-mode">3.1. Org mode</a></li>
<li><a href="#gdb">3.2. GDB</a></li>
<li><a href="#eshell">3.3. Eshell</a></li>
<li><a href="#grep">3.4. Grep</a></li>
<li><a href="#compilation">3.5. Compilation</a></li>
<li><a href="#browser-and-external-documentation">3.6. Browser and external documentation</a></li>
<li><a href="#erc">3.7. ERC</a></li>
<li><a href="#c-macro-expansion">3.8. C macro expansion</a></li>
<li><a href="#calculator">3.9. Calculator</a></li>
<li><a href="#misc">3.10. Misc</a></li>
</ul>
</li>
<li><a href="#external-packages">4. External packages</a>
<ul>
<li><a href="#evil-mode">4.1. Evil mode</a></li>
<li><a href="#magit">4.2. Magit</a></li>
<li><a href="#ediff">4.3. Ediff</a></li>
</ul>
</li>
<li><a href="#honorable-mentions">5. Honorable mentions</a></li>
</ul>
</div>
</div>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
<a href="https://www.gnu.org/software/emacs/">Emacs</a> is an amazing editor. I come from <a href="https://neovim.io/">neovim</a> and I decided to try <a href="https://github.com/doomemacs/doomemacs">doom emacs</a>
some years ago, and decided to eventually "doom-ify" vanilla Emacs to my liking,
removing all features I didn't like or use.
</p>

<p>
As you might have heard, Emacs <i>is not</i> a text editor, Emacs <i>has</i> a text editor. It
has a lot of features, and it's so easy to customize and extend that it creates
an amazing environment for programming or general text editing.
</p>

<p>
With that in mind, let me say that Emacs is not really comparable to vi-like
editors&#x2026; Because they are just editors. They do one thing, and they do it
really good: They let you edit text files, and very efficiently. Emacs is much
more, which can save time but might also be an overkill for some people.
</p>

<p>
I decided to make a list of some of the Emacs features/packages I enjoy the
most, mainly because I keep forgetting some stuff even exists. I am using GNU
Emacs version 29.3, in GNU/Linux.
</p>
</div>

<div id="outline-container-quick-note-about-vanilla-keybinds" class="outline-3">
<h3 id="quick-note-about-vanilla-keybinds"><span class="section-number-3">1.1.</span> Quick note about vanilla keybinds</h3>
<div class="outline-text-3" id="text-quick-note-about-vanilla-keybinds">
<p>
I don't like the vanilla GNU Emacs keybinds. At all. I don't know them and I
don't want to, even the most experienced Emacs users say they suck, and often
change them.
</p>

<p>
I use evil mode, which allows vi-like keybinds. See <a href="#evil-mode">Evil mode</a> bellow.
</p>

<p>
See also <a href="https://en.wikipedia.org/wiki/Repetitive_strain_injury">RSI</a>, <a href="http://xahlee.info/kbd/typing_rsi.html">Xah Lee's RSI page</a> and <a href="http://xahlee.info/emacs/emacs/emacs_pinky.html">Xah Lee's Emacs pinky page</a>.
</p>
</div>
</div>

<div id="outline-container-quick-note-about-keybind-notation" class="outline-3">
<h3 id="quick-note-about-keybind-notation"><span class="section-number-3">1.2.</span> Quick note about keybind notation</h3>
<div class="outline-text-3" id="text-quick-note-about-keybind-notation">
<p>
The key notation used in the Emacs context is the following.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-</code></td>
<td class="org-left">Press and hold the Control key</td>
</tr>

<tr>
<td class="org-left"><code>M-</code></td>
<td class="org-left">Press and hold the Meta (Alt) key</td>
</tr>

<tr>
<td class="org-left"><code>S-</code></td>
<td class="org-left">Press and hold the Shift key</td>
</tr>

<tr>
<td class="org-left"><code>DEL</code></td>
<td class="org-left">Press the Backspace key, <b>not the delete key</b></td>
</tr>

<tr>
<td class="org-left"><code>RET</code></td>
<td class="org-left">Press the Return or Enter key</td>
</tr>

<tr>
<td class="org-left"><code>SPC</code></td>
<td class="org-left">Press the Space bar</td>
</tr>

<tr>
<td class="org-left"><code>ESC</code></td>
<td class="org-left">Press the Escape key</td>
</tr>

<tr>
<td class="org-left"><code>TAB</code></td>
<td class="org-left">Press the Tab key</td>
</tr>
</tbody>
</table>

<p>
For example:
</p>

<ul class="org-ul">
<li><code>C-M-s</code> (or, equivalently, <code>M-C-s</code>): Press and hold both <b>Control</b> and <b>Meta</b> (Alt)
keys while hitting the <b>s</b> key.</li>
<li><code>SPC t c</code>: Press <b>Space</b>, then <b>t</b> and finally <b>c</b>.</li>
<li><code>M-x find-file RET</code>: Press and hold <b>Meta</b> (Alt), hit the <b>x</b> key, type " find-file ", and press
<b>Return</b>.</li>
</ul>

<p>
Note that <code>M-x ... RET</code> is a common pattern, since <code>M-x</code> opens the "execute command"
menu.
</p>
</div>
</div>
</div>

<div id="outline-container-general-design-choices" class="outline-2">
<h2 id="general-design-choices"><span class="section-number-2">2.</span> General design choices</h2>
<div class="outline-text-2" id="text-general-design-choices">
</div>

<div id="outline-container-gui-vs-terminal" class="outline-3">
<h3 id="gui-vs-terminal"><span class="section-number-3">2.1.</span> GUI vs. Terminal</h3>
<div class="outline-text-3" id="text-gui-vs-terminal">
<p>
Emacs is a GUI program. It can be ran in a terminal, but you will be limiting
its potential. The fact that Emacs has its own window has a lot of advantages
over terminal editors like neovim.
</p>

<p>
For example, you can display inline images, open PDF files, change the font
styles (without being limited by the terminal's styles), change the fonts
themselves for certain regions, etc.
</p>
</div>
</div>

<div id="outline-container-emacs-lisp" class="outline-3">
<h3 id="emacs-lisp"><span class="section-number-3">2.2.</span> Emacs Lisp</h3>
<div class="outline-text-3" id="text-emacs-lisp">
<p>
Emacs uses its own dialect of <a href="https://en.wikipedia.org/wiki/Lisp">Lisp</a> as its programming language: <a href="https://en.wikipedia.org/wiki/Emacs_Lisp">Emacs Lisp</a>.
</p>

<p>
I started looking at Lisp languages because Richard Stallman, one of the
creators of Emacs, recommended it in one of his talks. Then I found that Emacs
is made in its own Lisp dialect.
</p>

<p>
Since using Emacs, specially since switching to vanilla, I have learned a lot
about Lisp and functional programming, and I can say I don't regret it one bit.
</p>

<p>
Even if you don't use Emacs, <b>check out the Lisp language family</b>, you will learn
a lot.
</p>

<p>
Another interesting part about Emacs Lisp is its self documentation. If you go
to the <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/index.html">Emacs manual website</a>, you can read the following.
</p>

<blockquote>
<p>
Emacs is the advanced, extensible, customizable, <b>self-documenting</b> editor.
</p>
</blockquote>

<p>
They are not lying. Simply press <code>C-h v</code> and start typing a variable name to
display its documentation. You can also search for functions with <code>C-h f</code>.
</p>

<p>
See also: <a href="https://www.gnu.org/software/emacs/manual/pdf/elisp.pdf">Emacs Lisp manual (PDF)</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-built-in-features" class="outline-2">
<h2 id="built-in-features"><span class="section-number-2">3.</span> Built-in features</h2>
<div class="outline-text-2" id="text-built-in-features">
<p>
These packages are currently built into vanilla GNU Emacs, but this might not be
the case in older versions, so keep that in mind.
</p>
</div>

<div id="outline-container-org-mode" class="outline-3">
<h3 id="org-mode"><span class="section-number-3">3.1.</span> Org mode</h3>
<div class="outline-text-3" id="text-org-mode">
<p>
TODO
</p>
</div>
</div>

<div id="outline-container-gdb" class="outline-3">
<h3 id="gdb"><span class="section-number-3">3.2.</span> GDB</h3>
<div class="outline-text-3" id="text-gdb">
<p>
TODO
</p>
</div>
</div>

<div id="outline-container-eshell" class="outline-3">
<h3 id="eshell"><span class="section-number-3">3.3.</span> Eshell</h3>
<div class="outline-text-3" id="text-eshell">
<p>
TODO
</p>

<p>
At first I didnt like it
</p>
</div>
</div>

<div id="outline-container-grep" class="outline-3">
<h3 id="grep"><span class="section-number-3">3.4.</span> Grep</h3>
<div class="outline-text-3" id="text-grep">
<p>
TODO
</p>
</div>
</div>

<div id="outline-container-compilation" class="outline-3">
<h3 id="compilation"><span class="section-number-3">3.5.</span> Compilation</h3>
<div class="outline-text-3" id="text-compilation">
<p>
TODO
</p>

<p>
Links to errors in files
</p>
</div>
</div>

<div id="outline-container-browser-and-external-documentation" class="outline-3">
<h3 id="browser-and-external-documentation"><span class="section-number-3">3.6.</span> Browser and external documentation</h3>
<div class="outline-text-3" id="text-browser-and-external-documentation">
<p>
TODO
</p>

<ul class="org-ul">
<li>eww (not a replacement for browsers)</li>
<li>man</li>
</ul>
</div>
</div>

<div id="outline-container-erc" class="outline-3">
<h3 id="erc"><span class="section-number-3">3.7.</span> ERC</h3>
<div class="outline-text-3" id="text-erc">
<p>
TODO
</p>
</div>
</div>

<div id="outline-container-c-macro-expansion" class="outline-3">
<h3 id="c-macro-expansion"><span class="section-number-3">3.8.</span> C macro expansion</h3>
<div class="outline-text-3" id="text-c-macro-expansion">
<p>
TODO
</p>
</div>
</div>

<div id="outline-container-calculator" class="outline-3">
<h3 id="calculator"><span class="section-number-3">3.9.</span> Calculator</h3>
<div class="outline-text-3" id="text-calculator">
<p>
TODO
</p>

<p>
I dont know much about it, but its very interesting
</p>
</div>
</div>

<div id="outline-container-misc" class="outline-3">
<h3 id="misc"><span class="section-number-3">3.10.</span> Misc</h3>
<div class="outline-text-3" id="text-misc">
<p>
TODO
</p>

<p>
Games:
</p>
<ul class="org-ul">
<li>Zone</li>
<li>&#x2026;</li>
</ul>

<p>
Emms.
</p>
</div>
</div>
</div>

<div id="outline-container-external-packages" class="outline-2">
<h2 id="external-packages"><span class="section-number-2">4.</span> External packages</h2>
<div class="outline-text-2" id="text-external-packages">
<p>
These packages are currently not built into vanilla GNU Emacs, but this might
change in the future, so keep that in mind.
</p>
</div>

<div id="outline-container-evil-mode" class="outline-3">
<h3 id="evil-mode"><span class="section-number-3">4.1.</span> Evil mode</h3>
<div class="outline-text-3" id="text-evil-mode">
<p>
TODO
</p>
</div>
</div>

<div id="outline-container-magit" class="outline-3">
<h3 id="magit"><span class="section-number-3">4.2.</span> Magit</h3>
<div class="outline-text-3" id="text-magit">
<p>
TODO
</p>
</div>
</div>

<div id="outline-container-ediff" class="outline-3">
<h3 id="ediff"><span class="section-number-3">4.3.</span> Ediff</h3>
<div class="outline-text-3" id="text-ediff">
<p>
TODO
</p>

<p>
Integration with magit
</p>
</div>
</div>
</div>

<div id="outline-container-honorable-mentions" class="outline-2">
<h2 id="honorable-mentions"><span class="section-number-2">5.</span> Honorable mentions</h2>
<div class="outline-text-2" id="text-honorable-mentions">
<p>
TODO
</p>

<p>
Which-key, consult packages, etc.
</p>
</div>
</div>
</div>
</body>
</html>
